const version1 = {
    title: '个人优势',
    id: 1,
    text: `1. 通过官方文档和相关视频自学前端开发
    2. 在博客中分享遇到的问题以及解决方法
    3. 有BS/CS端开发经验
    4. 封装项目中常用组件
    5. 较高的技术热情和积极性，喜欢钻研新技术落地到业务场景 
    6. 熟练运用多种性能优化技巧，包括页面加载速度优化、响应式设计、代码分割与按需加载等，以提升用户体验和网站加载效率。`
}
const version2 = {
    title: '公司职责',
    id: 2,
    text: `1. 负责CS、BS、H5技术场景的架构
    2. 定制开发组件，对代码的优化，提升开发效率、质量和性能
    3. 对公司的项目，进行日常维护 Bug 处理，保证系统稳定性
    4. 与后端开发人员配合，实现产品页面的渲染和交互功能
    5. 与设计、产品和后台人员沟通，保证产品的质量和开发进度
    `
}

const version3 = {
    title: '个人评价',
    id: 3,
    text: `1.　有较强逻辑思维能力，分析解决问题能力；判断客户需求可行性；为人活泼开朗，做事认真负责，善于沟通，有团队协作精神；积极上进，善于学习。
    2. 热爱技术，平时喜欢浏览一些前端技术网站，博客等`
}

const version4 = {
    title: '总结',
    id: 4,
    text: `我以强烈的自主学习能力、问题解决能力以及多样化学习方法为基础，不断推动自己跟随技术发展。我的持续学习和适应能力使我能够快速掌握新技术，并将其应用于实际项目中，为团队的成功做出贡献。`
}
const boxContentArr = [
    version1, version2, version3, version4
]
export { boxContentArr }